{"data":{"markdownRemark":{"html":"<hr>\n<p>This is an experiment. I've decided to start publishing all of the private notes I write myself in the process of planning projects out and deciding what I want to do with my life.\nI write around 1,500 words per day. That's about the length of a short blog post, but those notes stay on my computer where no one can see them.\nThis is the first of what is going to be a series of stream-of-thought style posts. They will not be polished. There will be grammar mistakes. Let's see how it goes.</p>\n<hr>\n<p>I think I should share my process. The project I'm working on now is a very mission-driven, and I think that people would be interested in helping if I can get the word out.</p>\n<p>If people become invested in the process and see that they are making real contributions to the mission, they are going to feel a sense of ownership over the project that will make them want to support the project and help it grow.</p>\n<p>I think through all my ideas just like this. I write everything down in a stream of consciousness way as explore the problem from different angle. This leads to the creation a huge amount that I put in a folder and forget about, what I now think could be treated as pseudo blog posts.</p>\n<h2>The Benefits</h2>\n<ol>\n<li>It would force me to think in a clear and critical way. With people watching over my shoulder I get the immediate benefit of social feedback and critique. I can learn to defend and refine my ideas in real time. Just ignore the pure haters.</li>\n<li>Free marketing. </li>\n<li>I'll have documentation of the process that I can look back to later. It will be much easier to see a timeline of what I thought about, what I built, and when.</li>\n<li>I need expertise that I do not have. I need people to come on board who are experts in all kinds of things it would take me a lifetime to become an expert in. Those people can't join if they don't know this project exists.</li>\n</ol>\n<h2>Ways to Share</h2>\n<ol>\n<li>\n<p>Sharing mini-blogs the whole way through.</p>\n<ul>\n<li>Every one of these would get shared, all the time. This is to keep me from stressing out about having things polished. It's going to be about the process and about how I'm thinking about these things as I go. It's about documenting and keeping myself honest and maintaining perspective.</li>\n<li>In that vein, don't over-edit. I think that the way you structure your thoughts as you go is fine. It's not perfect, it's not always lucid, but you're pretty much there as far as grammar and spelling go. Don't worry so much.</li>\n</ul>\n</li>\n<li>\n<p>Sharing within your communities.</p>\n<p>These are the people that are going to allow you to bootstrap everything else. Your friends want to help you, give them a way to do that. Post about all these things in IndieHackers, on the Product Hunt maker's chat, in the shell group, Facebook, Twitter, etc. This works if you're open.</p>\n</li>\n<li>\n<p>Live-streaming</p>\n<p>This idea of sharing everything in public was spurred by <a href=\"http://levels.io\">levels.io</a> and also influenced by Gary V's advice to document your journey from a place of sincerity about your current position and perspective.</p>\n<p>I could live-stream my data munging, my research, coding, designing, even writing these posts could be live-streamed. A live-stream of these brain dumps could be interesting since I'm writing them at close to reading-speed and not going back to do much editing along the way.</p>\n</li>\n</ol>\n<h2>Social Pressure</h2>\n<p>My side hope is that sharing these things with the world will put social pressure on me to follow through, to work on this project every day, and to get it launched and out there as soon as possible.</p>\n<h2>Crowd-Sourced Solutions</h2>\n<p>If you have an audience following along with you, they can help you solve problems as you go. They can suggest approaches that you might not have thought of. They may even take on the mantle of researching approaches or data for you and bringing you back results that you can use right away.</p>\n<h2>Platform?</h2>\n<p>Alright, so what's the best platform to share these on? Medium comes to mind immediately. I researched this not that long ago and decided that the best way to do Medium is to publish your own blog and import into Medium so that you get both the SEO benefits for what you write, as well as exposure to the built-in Medium audience.</p>\n<p>The next question becomes, where to put the blog? It seems like it should be associated with the company/project, but there is no company/project right now. And since it's about the process, it's much more of a personal perspective.</p>\n<p>I think it makes the most sense to put the blog on <a href=\"http://castrio.me\">castrio.me</a> and then create a publication on medium for it that just reflects the same content. Side-perk, castrio.me is already built on top of Gatsby.js and ready to go as a blogging platform.</p>\n<h2>Is this all a distraction?</h2>\n<ol>\n<li>Not if you move fast enough.</li>\n<li>You get distracted anyway, at least your distraction might be productive.</li>\n</ol>\n<h2>What are your fears at this point?</h2>\n<p>My main fear is just that I put myself out there, that I share what I'm working on, and then that I don't follow through and nothing comes of it. That the project peters out and never launches like happens with many of the things that I start.</p>\n<p>You do control that outcome and you have launched things before.</p>\n<p>I wish it wasn't so hard to stay focused.</p>\n<p>Okay, one way you can hedge against this outcome is by making this process documentation not about just this project, but more your life process in general. Zooming out a bit, increasing the scope, makes the whole thing stronger. You're never not going to be re-evaluating your life, making plans, working on <em>something.</em></p>\n<p>Should I publish my backlog too?</p>","frontmatter":{"date":"November 20, 2018","path":"/blog/2018-11-20-working-in-public","title":"Working In Public","color":"#461811","image":"workstation.jpg","location":"Medellín, Colombia"}}},"pageContext":{}}