{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"This weekend I worked on a project. I wanted to find out what conditions give rise to emergent swarm-like behaviors in a population. I’m trying to answer this problem by running an evolution simulation. I have an environment with two types of…","frontmatter":{"title":"Swarm Evolution","date":"November 27, 2018","path":"/blog/2018-11-27-swarm-evolution","image":"swarm-evolution.png","color":"#000"}}},{"node":{"excerpt":"Geography Subreddits Here's 30 subreddits about geography, data science, earth science, and maps. The biggest (by far) is /r/dataisbeautiful with over 13.5 million subscribers at the time of writing, while the smallest, /r/datagangsta, has less than…","frontmatter":{"title":"Geography Subreddits","date":"November 23, 2018","path":"/blog/2018-11-22-geography-reddit-communities","image":"medellin-map.jpg","color":"#9d7441"}}},{"node":{"excerpt":"Climate Data Layers In Geographic Information Systems we think of data in layers. It's just like editing photos on photoshop, or making a collage. The layers get stacked on top of each other in interesting ways to reveal new information or to achieve…","frontmatter":{"title":"Climate Data Layers","date":"November 22, 2018","path":"/blog/2018-11-22-climate-data-layers","image":"salento-palms.jpg","color":"#545c20"}}},{"node":{"excerpt":"... This is the second post of an ongoing experiment: to share private notes publicly. Expect some errors. ... Project Description Create a “Walk-score” type service for environmental risks: Natural disasters Toxins Pollution Climate Change Sea Level…","frontmatter":{"title":"WalkScore for Climate Change","date":"November 21, 2018","path":"/blog/2018-11-21-walk-score-for-climate-change","image":"medellin-view.jpg","color":"#555c71"}}},{"node":{"excerpt":"... This is an experiment. I've decided to start publishing all of the private notes I write myself in the process of planning projects out and deciding what I want to do with my life. I write around 1,500 words per day. That's about the length of a…","frontmatter":{"title":"Working In Public","date":"November 20, 2018","path":"/blog/2018-11-20-working-in-public","image":"workstation.jpg","color":"#461811"}}},{"node":{"excerpt":"https://contigou.com/ ContigoU helps patients find skilled nursing rehab. In late 2017 I was contracted to build out the MVP for a seed stage healthcare technology startup. The company was founded by a veteran of the healthcare industry, a discharge…","frontmatter":{"title":"ContigoU","date":"January 01, 2018","path":"/projects/contigou","image":"contigou.svg","color":"#8ccfff"}}},{"node":{"excerpt":"https://formico.io Formico is a Software Development Agency. We focus on full-stack web development and machine learning projects. Our Web Development Stack Node.js React React Native GraphQL Our Machine Learning Stack scikit-learn Jupyter Notebooks","frontmatter":{"title":"Formico","date":"January 01, 2018","path":"/projects/formico","image":"formico.png","color":"#252444"}}},{"node":{"excerpt":"http://www.feie-test.com/ \n \n This website helps digital nomads save money on their taxes. Read the full blog post on Medium. Software Used: React.js  to build the webpage","frontmatter":{"title":"FEIE-Test","date":"January 01, 2017","path":"/projects/feie-test","image":"feie-test.svg","color":"#2f2f2f"}}},{"node":{"excerpt":"https://www.useloom.com/ Loom is a chrome extension for creating quick videos. It’s incredibly handy for customer service, sales, bug reports and a dozen other use cases. The company is backed by Slack and General Catalyst. While at Loom I rebuilt…","frontmatter":{"title":"Loom","date":"January 01, 2017","path":"/projects/loom","image":"loom.png","color":"#fd5f5f"}}},{"node":{"excerpt":"https://github.com/AntCas/OpenPanoThermo \n Project Thermo reliably creates thermographic panoramas of indoor locations in order to identify energy inefficiencies in rooms and buildings. I worked on this project as a volunteer at the Human Computer…","frontmatter":{"title":"HCIL - Project Thermo","date":"January 01, 2017","path":"/projects/hcil","image":"hcil.png","color":"#212020"}}},{"node":{"excerpt":"Amazon Sellers LA https://www.meetup.com/Amazon-Seller-Meetup-Los-Angeles/ I remotely organized a monthly meetup in Los Angeles, CA with over 250 members. FeelVision https://devpost.com/software/feelvision FeelVision is a navigation tool built for…","frontmatter":{"title":"Side Projects","date":"January 01, 2017","path":"/projects/side-projects","image":"projects.svg","color":"#2f3154"}}},{"node":{"excerpt":"https://bit.camp/ Bitcamp is the largest hackathon at the University of Maryland, hosting 1,500+ attendees anually.  In 2016 I took over as executive director of the event. We faced several challenges at the onset. The majority of the leadership from…","frontmatter":{"title":"Bitcamp","date":"January 01, 2016","path":"/projects/bitcamp","image":"bitcamp.png","color":"#1a2e33"}}},{"node":{"excerpt":"https://www.redfin.com/ Redfin is a vertically-integrated real estate and technology company. During my internship at Redfin I worked on the agent-tools team, building software for use by Redfin’s in-house real estate agents. I completed two major…","frontmatter":{"title":"Redfin","date":"January 01, 2016","path":"/projects/redfin","image":"redfin.png","color":"#c82022"}}},{"node":{"excerpt":"http://luvozo.com/ Luvozo builds robots for senior living. During my time at Luvozo I worked on two National Science Foundation backed projects improving the lives of senior citizens. Luvozo’s flagship product is a robot which could automatically…","frontmatter":{"title":"Luvozo","date":"January 01, 2016","path":"/projects/luvozo","image":"luvozo.png","color":"#246478"}}},{"node":{"excerpt":"http://gotechnica.org/ Technica is the largest all-ladies hackathon in the world, held annually at the University of Maryland, College Park. In 2015 I helped organize the first Technica hackathon. I built a team of mentors and volunteers and…","frontmatter":{"title":"Technica","date":"January 01, 2015","path":"/projects/technica","image":"technica.gif","color":"#111111"}}}]}},"pageContext":{}}