{"data":{"markdownRemark":{"html":"<p>...</p>\n<p>This is the second post of an ongoing experiment: to share private notes publicly. Expect some errors.</p>\n<p>...</p>\n<h1>Project Description</h1>\n<h2><strong>Create a “Walk-score” type service for environmental risks:</strong></h2>\n<ul>\n<li>Natural disasters</li>\n<li>Toxins</li>\n<li>Pollution</li>\n<li>Climate Change</li>\n<li>Sea Level Rise</li>\n<li>etc etc</li>\n</ul>\n<h2>Users can check their risk score for any given address</h2>\n<p>Payed plan allows user to adjust the weights of various factors or check many addresses</p>\n<p>Make the same service accessible via api</p>\n<p>Allow integrations into real estate websites etc</p>\n<hr>\n<h1><strong>Summary</strong></h1>\n<p>There are other natural disaster risk maps out there, but none of them are answering the question \"How does this impact me?\" nor the follow up question \"What can I do about it?\".</p>\n<p>I want to be able to plug in any address in the united states (eventually the world), and see every existential threat that I face and what action steps I can take.</p>\n<h2>Risks:</h2>\n<p>Natural Disasters, Unnatural Disasters (e.g. Fire), Health Risks, Pollution, and Climate Change</p>\n<h2>What I can do about it:</h2>\n<p>For natural disaster X, you can prepare by doing Y</p>\n<p>To combat pollution in your city, send this kind of message to this person who represents you (there’s definitely an api for looking that info up).</p>\n<p>For health risk A, take precaution B</p>\n<p>etc etc</p>\n<h2>Risk Scores</h2>\n<p>For every address we should be able to create a “Health Score”, “Natural Disaster Risk Score”, “Climate Change Risk Score”, “Pollution Score”, “Municipal Preparedness Score”, etc etc.</p>\n<p>Our goal is to make the data much easier to understand and much easier to act on.</p>\n<hr>\n<h1>Alignment With Personal Goals</h1>\n<p>This is the kind of thing you look for that has really good alignment on multiple levels:</p>\n<ol>\n<li>\n<p>Personal</p>\n<ul>\n<li>Professional Development</li>\n<li>Ownership of a Problem</li>\n<li>Problem You Care About</li>\n</ul>\n</li>\n<li>Family</li>\n<li>Community</li>\n<li>Global</li>\n</ol>\n<p>This is a problem that affects literally every person in the world. Market size of 7 billion people. Market impact of potentially the entire world economy. Is already a problem that’s literally changing the world.</p>\n<h1>Of course, the first version of the product is just going to:</h1>\n<ol>\n<li>Help people make better decisions about where to live</li>\n<li>Raise awareness in at-risk communities</li>\n<li>Increase pressure on municipalities to change</li>\n<li>Help investors build better risk models</li>\n</ol>\n<p>Dang, that’s still pretty fucking lofty.</p>\n<p>Even from initial searches it also seems that the data that’s out there is not easy enough to find or easy enough to consume for the average person. It needs to be at least as easy and nice to use as walkscore is. Right now it’s hard to find and not obvious what I should do about the threats.</p>\n<h1>We’re going to make it:</h1>\n<ol>\n<li>In your face</li>\n<li>Easy to consume</li>\n<li>Actionable</li>\n</ol>\n<h1>I think the things you are good at are:</h1>\n<ol>\n<li>Making UX that doesn’t totally suck, or at least recognizing when UX does suck</li>\n<li>Having broad capability, you can get by in a lot of domains</li>\n<li>Ability to create abstractions</li>\n</ol>\n<h1>Your biggest risks are:</h1>\n<ol>\n<li>Procrastination</li>\n<li>Not asking for as much help as you’ll need</li>\n<li>Self-doubt</li>\n<li>Anxiety and depression</li>\n</ol>\n<p>You’ll probably need to find yourself a psychologist if this has even the very littlest amount of success.</p>\n<h1>Capital Requirements?</h1>\n<p>You'll need capital to create enterprise/municipal solutions down the line. It might make sense to apply to YC with this one. I think if you have traction you’d have a change of getting in. They could help a lot with getting the right talent and advisors on board.</p>","frontmatter":{"date":"November 21, 2018","path":"/blog/2018-11-21-walk-score-for-climate-change","title":"WalkScore for Climate Change","color":"#555c71","image":"medellin-view.jpg","location":"Medellín, Colombia"}}},"pageContext":{}}