{"data":{"markdownRemark":{"html":"<h1>Emergent Swarm-Like Behaviour</h1>\n<p>This weekend I worked on a project.</p>\n<p>I wanted to find out what conditions give rise to emergent swarm-like behaviors in a population.</p>\n<p>I’m trying to answer this problem by running an evolution simulation.</p>\n<p>I have an environment with two types of creature.</p>\n<p>Creature A is populous and small. The longer they live, the more chances they get to breed. We’ll call this our prey creature.</p>\n<p>Creature B has a small population, they are bigger and faster. The more prey they eat, the stronger they are, and the more chances they get to breed. We’ll call this our predator creature.</p>\n<h1>Evolution</h1>\n<p>The creatures have a genetic breeding mechanism. They have “genes” that control their behavior and senses that allow them to detect whether they are near an ally or an enemy.</p>\n<p>Creatures don’t innately know whether which is which, at first. They must learn who is who, and how to respond to each, through evolution.</p>\n<p>Prey that get eaten quickly don’t breed as much as prey who survive a long time. Therefore, genes that help prey stay alive should be passed down more often than genes that get prey eaten. Over time, the whole population of prey should consist of individuals who’s ancestors were good at not getting eaten.</p>\n<p>It’s a similar story with the Predators. Predators that don’t eat, don’t get to breed as much as Predators that do. Predators who eat the most prey will dominate the breeding pool. Over time, the whole population of predators should consist of individuals who’s ancestors were good at eating prey.</p>\n<h1>Behaviour</h1>\n<p>With these constraints in place, can prey creatures develop cooperative behavior? Would predators learn to pack hunt? Will prey swarm, or simply evade?</p>\n<p>If these factors are not sufficient, then what other factors must be present before swarming or pack-hunting behavior emerges? How complex must their brains be? What evolutionary pressures must exist? How does their physiology affect their behavior?</p>\n<p>Both predator and prey have the same “brain” structure. Their behavioral difference are currently only affected by their dna. The Predators are a bit bigger and faster and can see a bit farther, but there are less than them.</p>\n<p>What happens if we change their morphology? e.g. what if prey are big and predators are small? What if we change how far they can see? The directions in which they can see? How well they can see what they’re looking at?</p>\n<p>I hope to find a very simple set of criteria that allow these behaviors to emerge. It may just take a long time.</p>\n<h1>What do creatures look like? What can they sense?</h1>\n<p>[ Diagram of creatures w/ visual range, size, and sensors ] —> 2 diagrams?</p>\n<p>Each creature has a circular body.</p>\n<p>They can sense creatures near to them in four continuous directions, equally spaced around their body.</p>\n<p>In each direction they can see how close their nearest ally is and how close their nearest opponent is.</p>\n<p>In one direction of site they have one neuron for enemy-detection and one neuron for ally-detection.</p>\n<p>Therefore, if there is more than one enemy or ally in a certain direction, they can only sense the nearest.</p>\n<p>They are in a way both “near-sighted” and “round-sighted”. They can see the closest enemy or ally to them in all directions and they have a sense of how far away that creature is within the limits of their vision.</p>\n<p>If there are no creatures within their visual range, then they can’t see anything.</p>\n<p>Imagine they are fish in the ocean. Beyond a certain point, all they can see is the darkness of the ocean.</p>\n<h1>How do creatures move?</h1>\n<p>[ diagram of steering wheel ]</p>\n<p>Each creature moves at a constant rate of speed.They can not choose to speed up or slow down.</p>\n<p>Unless they choose to turn, they will continue to move in a straight line. The direction of travel is described by their orientation.</p>\n<p>When they turn, it is at a constant rate of rotation. In other words, no sharp turns, they have a fixed turning radius.</p>\n<p>Each of these attributes is something that may be adjusted. What would happen if we gave creatures control over their turning radius? Their speed?</p>\n<h1>How do their brains work?</h1>\n<p>[ diagram of NN ]</p>\n<p>Their brains are a neural network.</p>\n<p>The human brain is made of many interconnected neurons. When one neuron receives an electric charge it may or may not pass that charge on to any of the many neurons it is connected to.</p>\n<p>A neural net operates in the same way. It’s like a very simple model of a biological neural system.</p>\n<p>In the human brain, the base unit his the neuron. </p>\n<p>[ Diagram of a neuron ]</p>\n<p>In the computer neural network, the base unit is the perceptron</p>\n<p>[ Diagram of a perceptron ]</p>\n<p>the perceptron has inputs and outputs, just like a neuron.</p>\n<p>Instead of electricity, the perceptron receives a number from each of the perceptrons connected to its inputs.</p>\n<p>the perceptron has a setting for each input that tells it how much to care about that input. We call these settings “weights”.</p>\n<p>If a perceptron weights one input highly, it cares about that input a lot, and will output a higher number in response.</p>\n<p>The perceptron sense a number to each of its output based on the result of an activation function.</p>\n<p>The activation function receives a number based on the combined weights of the inputs and outputs a new number that is sent to the output neighbors.</p>\n<p>We usually organize these perceptrons into “layers”. In the case of our organisms, we have 3 layers.</p>\n<p>At the top is the Input layer. It’s the numbers are sense neurons receive. Since we have 4 directions our organism can see in and 2 perceptrons per direction, our input layer has 8 perceptrons in total.</p>\n<p>At the bottom is our output layer. Our organism can rotate clockwise or counterclockwise. That’s 2 options, so the organism gets two output perceptrons.</p>\n<p>In the middle of the two, we have a “hidden” layer. This layer exists so that the organism can learn more complex behavior. A neural network can have many layers and each layer can have any number of nodes.</p>\n<p>In our case our organism have just one hidden layer and that hidden layer has just 4 nodes. </p>\n<p>[ NN Diagram ]</p>\n<p>A neural network “learns” by adjusting the weights of all the connections among its perceptrons to get a better answer. </p>\n<p>There’s a lot of weighs a computer can figure out the best set of weights.</p>\n<p>For our purposes we are going to use evolution.</p>\n<h1>How do the organisms evolve?</h1>\n<p>Each organism has a DNA which defines its behavior. This “DNA” is actually just the set of weights used by the neural network.</p>\n<p>When two organisms breed, their offspring randomly inherits one of their parents weights or “genes” for a particular neural connection.</p>\n<p>There is also a small chance of that neuron randomly mutating to be a different weight. These random changes simulate the random mutations found in nature which can cause new behaviors to emerge at random. </p>\n<p>If the new gene causes a behavior that helps the organism survive, it will be more likely to pass down that gene.</p>\n<p>How do they organisms choose who to breed with?</p>\n<p>Each organism in our model breeds at least once. If they are fitter than the population as a whole, they will get more chances to breed again.</p>\n<p>The fitter the organism, the more likely it is to breed multiple times.</p>\n<p>We can think of the gene pool as a kind of roulette wheel where fitter organisms take up a larger wedge of the wheel. </p>\n<p>At the end of a round of the simulation, the old generation is replaced with their offspring. </p>\n<p>[ link to shiffman ]</p>\n<h1>What are the results so far?</h1>\n<p>The untrained organisms were surprisingly intelligent. Even without training, the structure of their brains makes them move around in a way that looks not unlike real creatures.</p>\n<p>So far I’ve only run the simulation up to 100 generations and with only small tweaks. At times the organisms do follow each other around in what you could describe as a kind of porto-swarm behavior. </p>\n<p>I think it will take 2-10 times longer to see this porto-swarm behavior develop into something more obviously swarm-like.</p>\n<p>From my initial observations, I also suspect that the organism will need better, denser vision in order to develop the behavior we’re looking for. As well as finer control over their turning radius. </p>\n<p>With the way their field of vision works right now, they can’t tell the difference between a creature right in front of them and one 90 degrees away if those creatures are close to the boundaries of their vision. </p>\n<p>If they had more sight neurons, or if all their sight neurons were packed on one side of their body, they would be able to make finer adjustments in their motion.</p>\n<p>My next experiments with this system will tweak their vision and orientation control in this way. I also want to experiment with much larger populations that live longer and breed over more generations.</p>","frontmatter":{"date":"November 27, 2018","path":"/blog/2018-11-27-swarm-evolution","title":"Swarm Evolution","color":"#000","image":"swarm-evolution.png","location":"Medellín, Colombia"}}},"pageContext":{}}